export const AuthErrorMessages = {
	/**
	 * Пароль должен быть от 5 до 30 символов
	 */
	PASSWORD_LONG: 'Пароль должен быть от 5 до 30 символов',
	/**
	 * Неверно указан email
	 */
	EMAIL_NOT_VALID: 'Неверно указан email',
	/**
	 * Такой email уже зарегистрирован
	 */
	EMAIL_ALREADY_REGISTERED: 'Такой email уже зарегистрирован',
	/**
	 * Пользователь с таким email не зарегистрирован
	 */
	EMAIL_NOT_FOUND: 'Пользователь с таким email не зарегистрирован',
	/**
	 * Неверный пароль
	 */
	PASSWORD_FAILED: 'Неверный пароль',
	/**
	 * Невалидный токен, или время действия токена закончено
	 */
	REFRESH_TOKEN_NOT_VALID: 'Невалидный токен, или время действия токена закончено',
	/**
	 * Неккоректный токен
	 */
	REFRESH_TOKEN_NOT_CORRECT: 'Неккоректный токен',
	/**
	 * Вы не авторизованы. Пожалуйста, войдите в систему
	 */
	UNAUTHORIZED: 'Вы не авторизованы. Пожалуйста, войдите в систему',
	/**
	 * Нет прав доступа
	 */
	FORBIDDEN: 'Нет прав доступа',
};
