export const GenreErrorMessages = {
	/**
	 * Жанр не найден
	 */
	GENRE_NOT_FOUND: 'Жанр не найден',
	/**
	 * Такой жанр уже создан 'Название жанра не может быть пустым'
	 */
	GENRE_ALREADY_REGISTERED: 'Такой жанр уже создан',
	/**
	 * Название жанра не может быть пустым
	 */
	GENRE_TITLE_CANT_BE_EMPTY: 'Название жанра не может быть пустым',
	/**
	 * Название жанра должно быть строкой
	 */
	GENRE_TITLE_SHOULD_BE_STRING: 'Название жанра должно быть строкой',
	/**
	 * Slug жанра должен быть строкой
	 */
	GENRE_SLUG_SHOULD_BE_STRING: 'Slug жанра должен быть строкой',
	/**
	 * Описание жанра должно быть строкой
	 */
	GENRE_DESCRIPTION_SHOULD_BE_STRING: 'Описание жанра должно быть строкой',
	/**
	 * Иконка жанра должно быть строкой
	 */
	GENRE_ICON_SHOULD_BE_STRING: 'Иконка жанра должно быть строкой',
};
